Чаты_единое_окно/src/Documents/СпотоваяСделка/СпотоваяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпотоваяСделка</name>
  <registerRecords>AccumulationRegister.СпотовыеСделки</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Криптовалюта</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Чаты_единое_окно/src/AccumulationRegisters/СпотовыеСделки/СпотовыеСделки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СпотовыеСделки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Прибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Криптовалюта</name>
    <type>
      <types>CatalogRef.Криптовалюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Чаты_единое_окно/src/Enums/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций</name>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

Чаты_единое_окно/src/Documents/СпотоваяСделка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияПоСпотовымОперациям(Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоСпотовымОперациям(Отказ)
	
	Движения.СпотовыеСделки.Записать();
	Движения.СпотовыеСделки.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ВидыОпераций.Покупка Тогда
		СформироватьДвиженияПоСпотовымОперациямПриход(Отказ);		
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.Продажа Тогда
		СформироватьДвиженияПоСпотовымОперациямРасход(Отказ);	
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Вид операции неопределен, проведение документа не возможно.'"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоСпотовымОперациямПриход(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпотоваяСделка.Ссылка       КАК Регистратор,
	|	СпотоваяСделка.Дата         КАК Период,
	|	СпотоваяСделка.Криптовалюта КАК Криптовалюта,
	|	СпотоваяСделка.Количество   КАК Количество,
	|	СпотоваяСделка.Сумма        КАК Сумма
	|ИЗ
	|	Документ.СпотоваяСделка КАК СпотоваяСделка
	|ГДЕ
	|	СпотоваяСделка.Ссылка = &Ссылка
	|";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.СпотовыеСделки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоСпотовымОперациямРасход(Отказ)
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.СпотовыеСделки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Криптовалюта", Криптовалюта);
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru='Не удалось установить блокировку по причине %1'"), ОписаниеОшибки());
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпотоваяСделка.Криптовалюта КАК Криптовалюта,
	|	СпотоваяСделка.Количество   КАК Количество,
	|	СпотоваяСделка.Сумма        КАК Сумма
	|
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|
	|ИЗ
	|	Документ.СпотоваяСделка КАК СпотоваяСделка
	|ГДЕ
	|	СпотоваяСделка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпотовыеСделкиОстатки.Криптовалюта		КАК Криптовалюта,
	|	СпотовыеСделкиОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СпотовыеСделкиОстатки.СуммаОстаток		КАК СтоимостьОстаток
	|
	|ПОМЕСТИТЬ ВТ_СпотовыеСделкиОстатки
	|
	|ИЗ
	|	РегистрНакопления.СпотовыеСделки.Остатки(
	|				&МоментВремени,
	|				Криптовалюта В
	|						(ВЫБРАТЬ
	|							ВТ_ДанныеДокумента.Криптовалюта КАК Криптовалюта
	|						ИЗ
	|							ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК СпотовыеСделкиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Криптовалюта 						КАК Криптовалюта,
	|	ВТ_ДанныеДокумента.Количество 							КАК КоличествоВДокументе,
	|	ВТ_ДанныеДокумента.Сумма 								КАК СуммаВДокументе,
	|	ЕСТЬNULL(ВТ_СпотовыеСделкиОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_СпотовыеСделкиОстатки.СтоимостьОстаток, 0) 	КАК СтоимостьОстаток,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ДанныеДокумента.Криптовалюта) 			КАК КриптовалютаПредставление
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпотовыеСделкиОстатки КАК ВТ_СпотовыеСделкиОстатки
	|		ПО ВТ_ДанныеДокумента.Криптовалюта = ВТ_СпотовыеСделкиОстатки.Криптовалюта
	|
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СтоимостьОстаток)
	|ПО
	|	Криптовалюта
	|";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКриптовалюты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКриптовалюты.Следующий() Цикл
		
		Если ВыборкаКриптовалюты.КоличествоВДокументе > ВыборкаКриптовалюты.КоличествоОстаток Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				НСтр("ru='По криптовалюте %1 не хватает количества. Реально есть %2'"), 
				ВыборкаКриптовалюты.КриптовалютаПредставление, ВыборкаКриптовалюты.КоличествоОстаток
			);
			Сообщение.Сообщить(); 
			Отказ = Истина;
			Продолжить;
		КонецЕсли; 
		
		Если Не Отказ Тогда
			
			ОсталосьСписать = ВыборкаКриптовалюты.КоличествоВДокументе; 
			
			ВыборкаДетальныеЗаписи = ВыборкаКриптовалюты.Выбрать();
			
			Пока ОсталосьСписать > 0 И ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.СпотовыеСделки.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Криптовалюта 	= ВыборкаДетальныеЗаписи.Криптовалюта;
				Движение.Количество 	= Мин(ОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
				СуммаСписания = ?(ВыборкаКриптовалюты.КоличествоОстаток = Движение.Количество, ВыборкаКриптовалюты.СтоимостьОстаток,
					ВыборкаКриптовалюты.СтоимостьОстаток / ВыборкаКриптовалюты.КоличествоОстаток * Движение.Количество);
					
				Движение.Сумма 			= СуммаСписания;
				
				Движение.Прибыль        =  ВыборкаКриптовалюты.СуммаВДокументе - ВыборкаКриптовалюты.СтоимостьОстаток;
					
				ОсталосьСписать = ОсталосьСписать - Движение.Количество;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
